src/Catalogs/ИсторияХранилища/ИсторияХранилища.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ИсторияХранилища</name>
  <owners>Catalog.Хранилища</owners>
  <attributes>
    <name>Автор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Версия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Дата</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Метка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Изменены</name>
    <attributes>
      <name>ИмяОбъекта</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>300</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Добавлены</name>
    <attributes>
      <name>ИмяОбъекта</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>300</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Удалены</name>
    <attributes>
      <name>ИмяОбъекта</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>300</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ФайлыGit</name>
    <attributes>
      <name>Флаг</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Файл</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>СтарыйФайл</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>СтрокДобавлено</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтрокУдалено</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/InformationRegisters/ЗадачиМетеорВерсийХранилища/ЗадачиМетеорВерсийХранилища.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЗадачиМетеорВерсийХранилища</name>
  <resources>
    <name>ЗадачаМетеор</name>
    <type>
      <types>CatalogRef.ЗадачиМетеор</types>
    </type>
  </resources>
  <dimensions>
    <name>ВерсияХранилища</name>
    <type>
      <types>CatalogRef.ИсторияХранилища</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/ЖурналМониторинга/ЖурналМониторинга.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЖурналМониторинга</name>
  <resources>
    <name>Этап</name>
    <type>
      <types>EnumRef.ЭтапыОперацийМониторинга</types>
    </type>
  </resources>
  <resources>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Значение</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ДатаЗаписи</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыполненСОшибкой</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>КлючеваяОперация</name>
    <type>
      <types>CatalogRef.КлючевыеОперацииМониторинга</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Идентификатор</name>
    <type>
      <types>CatalogRef.ИсторияХранилища</types>
      <types>CatalogRef.Хранилища</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаЗаписиУниверсальная</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерСеанса</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаЗаписиНачалоДня</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/ОчередьПолученияИзмененийОбъектовВерсийХранилища/ОчередьПолученияИзмененийОбъектовВерсийХранилища.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОчередьПолученияИзмененийОбъектовВерсийХранилища</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыОперацийОбработкиОчереди</types>
    </type>
  </resources>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <dimensions>
    <name>ВерсияХранилища</name>
    <type>
      <types>CatalogRef.ИсторияХранилища</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Enums/СтатусыИсторииХранилищ/СтатусыИсторииХранилищ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыИсторииХранилищ</name>
  <enumValues>
    <name>ЗагрузкаДанных</name>
  </enumValues>
  <enumValues>
    <name>ПредварительнаяПроверка</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеПереноса</name>
  </enumValues>
  <enumValues>
    <name>Перенос</name>
  </enumValues>
  <enumValues>
    <name>Перенесено</name>
  </enumValues>
  <enumValues>
    <name>Ошибка</name>
  </enumValues>
</mdclass:Enum>

src/Enums/ЭтапыОперацийМониторинга/ЭтапыОперацийМониторинга.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ЭтапыОперацийМониторинга</name>
  <enumValues>
    <name>Начало</name>
  </enumValues>
  <enumValues>
    <name>Завершение</name>
  </enumValues>
  <enumValues>
    <name>ЗамерВремени</name>
  </enumValues>
</mdclass:Enum>

src/Enums/СтатусыОперацийОбработкиОчереди/СтатусыОперацийОбработкиОчереди.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыОперацийОбработкиОчереди</name>
  <enumValues>
    <name>ОжидаетОбработки</name>
  </enumValues>
  <enumValues>
    <name>Обработано</name>
  </enumValues>
  <enumValues>
    <name>Ошибка</name>
  </enumValues>
</mdclass:Enum>

src/Catalogs/КлючевыеОперацииМониторинга/КлючевыеОперацииМониторинга.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КлючевыеОперацииМониторинга</name>
  <predefined>
    <items>
      <name>АвтоматизированнаяПроверкаВерсииХранилища</name>
      <description>Автоматизированная проверка версии хранилища</description>
    </items>
    <items>
      <name>ВыполнениеСкрипта_getRepoHistory_Время</name>
      <description>Выполнение скрипта get repo history: время выполнения</description>
    </items>
    <items>
      <name>ВыполнениеСкрипта_getRepoHistory</name>
      <description>Выполнение скрипта getRepoHistory</description>
    </items>
    <items>
      <name>СинхронизацияХранилищаС_GIT_ВыполнениеСкрипта</name>
      <description>Выполнение скрипта gitSync</description>
    </items>
    <items>
      <name>ДлительностьПроверкиКоммитаАПК</name>
      <description>Длительность проверки коммита АПК</description>
    </items>
    <items>
      <name>ЗагрузкаИОбработкаВерсииИсторииХранилища</name>
      <description>Загрузка и обработка версии истории хранилища</description>
    </items>
    <items>
      <name>СинхронизацияХранилищаС_GIT</name>
      <description>Синхронизация хранилища с GIT</description>
    </items>
  </predefined>
  <attributes>
    <name>Имя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЦелевоеВремя</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяХеш</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

src/Catalogs/Конфигурации/Конфигурации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Конфигурации</name>
  <predefined>
    <items>
      <name>Финансы1С</name>
      <description>Финансы 1 С</description>
    </items>
  </predefined>
  <attributes>
    <name>Идентификатор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ХранилищеРазработки</name>
    <type>
      <types>CatalogRef.Хранилища</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранилищеОбновления</name>
    <type>
      <types>CatalogRef.Хранилища</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользуетсяКонвейерОбработки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СоздаватьБазыТестирования</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЛогическаяПодсистемаПоУмолчанию</name>
    <type>
      <types>CatalogRef.ЛогическиеПодсистемы</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроектGitEDT</name>
    <type>
      <types>CatalogRef.ПроектыGIT</types>
    </type>
  </attributes>
  <attributes>
    <name>МаксимальноеВремяЗахватаПоУмолчаниюЧасов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ИсключаемыеАвторы</name>
    <attributes>
      <name>ИмяПользователя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ШагиКонвейера</name>
    <attributes>
      <name>ДействиеКонвейераОбработки</name>
      <type>
        <types>CatalogRef.ДействияКонвейераОбработки</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТестовыеБазы</name>
    <attributes>
      <name>Наименование</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтрокаСоединенияИсточник</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтрокаСоединенияПриемник</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПометкаУдаления</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОбъектыЗапускаИнтеграционныхТестов</name>
    <attributes>
      <name>ИмяОбъекта</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>300</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Catalogs/ИсторияХранилища/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	ДополнительныеСвойства.Вставить("ЭтоНовый", ЭтоНовый());
	РасширитьИзменныеДанные();
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ДополнительныеСвойства.ЭтоНовый Тогда
		РаботаСХранилищами.ЗаписатьСтатусВерсииХранилища(Ссылка, Перечисления.СтатусыИсторииХранилищ.ЗагрузкаДанных);
	КонецЕсли;
	
	Если ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Владелец, "ХранилищеРазработки") Тогда
		ЗначенияРесурсов = РегистрыСведений.ЗадачиМетеорВерсийХранилища.Получить(Новый Структура("ВерсияХранилища", Ссылка));
		ЗадачаМетеор = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ЗначенияРесурсов, "ЗадачаМетеор");
		Если ДополнительныеСвойства.ЭтоНовый Тогда
				Мониторинг.ЗаписатьНачалоОперации(
				Справочники.КлючевыеОперацииМониторинга.АвтоматизированнаяПроверкаВерсииХранилища,
				Ссылка,
				ЗадачаМетеор
				);
			Попытка
				НаборЗаписей = РегистрыСведений.ЖурналМониторинга.СоздатьНаборЗаписей();
				Запись = НаборЗаписей.Добавить();	
				Запись.КлючеваяОперация = Справочники.КлючевыеОперацииМониторинга.СинхронизацияХранилищаС_GIT;
				Запись.Идентификатор = Ссылка;
				Запись.ДатаЗаписиУниверсальная = (УниверсальноеВремя(Дата) - '00010101')*1000;
				Запись.НомерСеанса = НомерСеансаИнформационнойБазы();
				Запись.Этап = Перечисления.ЭтапыОперацийМониторинга.Начало;
				Запись.ДатаЗаписи = Дата;
				Запись.ДатаЗаписиНачалоДня = НачалоДня(Запись.ДатаЗаписи);
				Запись.Комментарий = "Фиксация события датой помещения версии в хранилище.";
				
				ЗаписьЗагрузкаИОбработка = НаборЗаписей.Добавить();
				ЗаполнитьЗначенияСвойств(ЗаписьЗагрузкаИОбработка, Запись);
				ЗаписьЗагрузкаИОбработка.ДатаЗаписиУниверсальная = (УниверсальноеВремя(Дата) - '00010101')*1000;
				ЗаписьЗагрузкаИОбработка.КлючеваяОперация = Справочники.КлючевыеОперацииМониторинга.ЗагрузкаИОбработкаВерсииИсторииХранилища;
				
				НаборЗаписей.Записать(Ложь);
			Исключение
			КонецПопытки;
		КонецЕсли;
	КонецЕсли;
	
	Если ДополнительныеСвойства.ЭтоНовый Тогда
		Попытка
			КешВерсийХранилищ.ДобавитьВерсиюВОчередьВыгрузки(Ссылка);
		Исключение
			ЗаписьЖурналаРегистрации(
				"Кеш версий хранилищ.Добавление версии в очередь",
				УровеньЖурналаРегистрации.Предупреждение,
				Метаданные.РегистрыСведений.ОчередьПолученияВерсийКонфигурации,
				Ссылка,
				ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		КонецПопытки;
		Попытка
			Запрос = Новый Запрос;
			Запрос.УстановитьПараметр("Ссылка", Ссылка);
			Запрос.Текст = 
				"ВЫБРАТЬ
				|	ИсторияХранилища.Ссылка КАК Ссылка
				|ИЗ
				|	Справочник.ИсторияХранилища КАК ИсторияХранилища
				|ГДЕ
				|	ИсторияХранилища.Ссылка = &Ссылка
				|	И ИсторияХранилища.Владелец В
				|			(ВЫБРАТЬ
				|				Конфигурации.ХранилищеРазработки КАК ХранилищеРазработки
				|			ИЗ
				|				Справочник.Конфигурации КАК Конфигурации)";
			Если Не Запрос.Выполнить().Пустой() Тогда
				Менеджер = РегистрыСведений.ОчередьПолученияИзмененийОбъектовВерсийХранилища.СоздатьМенеджерЗаписи();
				Менеджер.Период = ТекущаяДатаСеанса();
				Менеджер.ВерсияХранилища = Ссылка;
				Менеджер.Статус = Перечисления.СтатусыОперацийОбработкиОчереди.ОжидаетОбработки;
				Менеджер.Записать();
			КонецЕсли;
		Исключение
			ЗаписьЖурналаРегистрации(
				"Получение изменений версий.Добавление версии в очередь",
				УровеньЖурналаРегистрации.Ошибка,
				Метаданные.РегистрыСведений.ОчередьПолученияИзмененийОбъектовВерсийХранилища,
				Ссылка,
				ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		КонецПопытки;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура РасширитьИзменныеДанные()
	
	Для Каждого СтрокаИзмененияПоGit Из ИзменнынеОбъектыПоGit() Цикл
		
		СтрокаНовоеИмя = НайтиСтрокуПоИмени(СтрокаИзмененияПоGit.НовоеИмя, Изменены);
		Если СтрокаНовоеИмя = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		СтароеИмя = СтрЗаменить(СтрокаНовоеИмя.ИмяОбъекта, СтрокаИзмененияПоGit.НовоеИмя, СтрокаИзмененияПоGit.СтароеИмя);
		СтрокаСтароеИмя = НайтиСтрокуПоИмени(СтароеИмя, Изменены);
		Если СтрокаСтароеИмя = Неопределено Тогда
			НоваяСтрока = Изменены.Добавить();
			НоваяСтрока.ИмяОбъекта = СтароеИмя;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Функция ИзменнынеОбъектыПоGit()
	
	ИзменнынеОбъектыПоGit = Новый ТаблицаЗначений;
	ИзменнынеОбъектыПоGit.Колонки.Добавить("НовоеИмя");
	ИзменнынеОбъектыПоGit.Колонки.Добавить("СтароеИмя");
	
	Для Каждого Строка Из ФайлыGit Цикл
		
		Если Не Строка.Флаг = Флаг_Переименован() Тогда
			Продолжить;
		КонецЕсли;
		
		НоваяСтрока = ИзменнынеОбъектыПоGit.Добавить();
		НоваяСтрока.НовоеИмя = ИмяФайла(Строка.Файл);
		НоваяСтрока.СтароеИмя = ИмяФайла(Строка.СтарыйФайл);
		
	КонецЦикла;
	
	Возврат ИзменнынеОбъектыПоGit;
	
КонецФункции

Функция Флаг_Переименован()
	
	Возврат "R";
	
КонецФункции

Функция ИмяФайла(ПолныйПуть)
	
	Начало = СтрНайти(ПолныйПуть, "/", НаправлениеПоиска.СКонца) + 1;
	Конец = СтрНайти(ПолныйПуть, ".", НаправлениеПоиска.СКонца) - 1;
	Если Конец = -1 Тогда
		Конец = СтрДлина(ПолныйПуть);
	КонецЕсли;
			
	Возврат Сред(ПолныйПуть, Начало, Конец - Начало + 1);
	
КонецФункции

Функция НайтиСтрокуПоИмени(Имя, ТабличнаяЧасть)
	
	НайденнаяСтрока = Неопределено;
	
	Для Каждого Строка Из ТабличнаяЧасть Цикл
		
		Начало = СтрНайти(Строка.ИмяОбъекта, Имя);
		Если Не Начало = 0
			И Не (Начало > 1 И Не Сред(Строка.ИмяОбъекта, Начало - 1, 1) = ".")
			И Начало + СтрДлина(Имя) - 1 = СтрДлина(Строка.ИмяОбъекта) Тогда
			НайденнаяСтрока = Строка;
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат НайденнаяСтрока;
	
КонецФункции

#КонецОбласти

#КонецЕсли
